{
    "title": "Portfolio",
    "jobTitle": "Senior Software Entwicklerin",
    "location": "Stuttgart",
    "subHeader1": "Fachwissen",
    "subHeader2": "Erfahrungen",
    "description": "Leidenschaftlicher und detailorientierter Frontend-Entwickler mit mehr als 4 Jahren Erfahrung habe ich mich auf die Erstellung visuell ansprechender und nahtloser Benutzererlebnisse spezialisiert. Ich beherrsche HTML, CSS und TypeScript mit Expertise in DOM-Manipulation, Tailwind für modernes Styling und Angular für die Entwicklung dynamischer und responsiver Webanwendungen. Ich bringe Hingabe, Kreativität und einen kollaborativen Geist in jedes Projekt ein.",
    "experience": [
        {
            "company": "Barclays",
            "logo": "/assets/images/barclays_logo.jpg",
            "link": "https://www.linkedin.com/company/barclays-bank/",
            "type": "Vollzeit",
            "duration": "4 jahre 2 monate",
            "location": "Chennai, Indien",
            "roles": [
                {
                    "title": "Senior Entwicklerin",
                    "start": "März 2023", 
                    "end":"November 2024",
                    "description": [
                        "Verantwortlich für den Entwurf und die Entwicklung der Reconciliation Suite von Grund auf, einschließlich der Matching Engine, des Portals zur Anzeige von Brüchen usw",
                        "Verwaltung des UI-Teams, einschließlich Aufgabendelegation, Überprüfung von Pull-Anfragen, Einarbeitung und Schulung neuer Teammitglieder.",
                        "Beteiligung an der Anforderungsanalyse, an Design-Diskussionen und an Vorschlägen für optimale Lösungen zur Erreichung der Projektziele.",
                        "Motivierte die enge Zusammenarbeit mit dem UI/UX-Team, hielt sich strikt an die branchenführenden Best Practices und bewahrte so während des gesamten Entwicklungsprozesses außergewöhnliche Standards für die Codequalität."
                    ]
                },
                {
                    "title": "Junior Entwicklerin",
                    "start": "August 2020", 
                    "end":"Februar 2023",
                    "description": [
                        "Entwicklung dynamischer Dashboards, ansprechender Diagramme, reaktionsschneller Raster und interaktiver Formulare, die auf eine KI/ML-basierte Anwendung zugeschnitten sind und eine unvergleichliche Visualisierung prädiktiver Erkenntnisse bieten sollen",
                        "Pionierarbeit bei der Entwicklung einer Mikro-Frontend-Architektur, die die Integration unterschiedlicher Einzelanwendungen in eine einheitliche und integrierte Plattform ermöglicht und so die Skalierbarkeit und Wartungsfreundlichkeit verbessert",
                        "Nutzung einer Vielzahl von Bibliotheken wie Angular Material, Rxjs, AG-Grid, PrimeNg, Ngx-echarts, Gridster usw.",
                        "Nahtlose Integration von Single Sign On Authentifizierung, die einen optimierten Zugriff und erhöhte Sicherheit für die Benutzer gewährleistet",
                        "Entwicklung eines regelbasierten Workflow-Prozesses, der es den Benutzern ermöglicht, mühelos Anfragen einzureichen, zu überwachen und zu genehmigen", 
                        "Implementierung robuster Unit Testing Methoden, die eine außergewöhnliche Code-Abdeckung gewährleisten und die Zuverlässigkeit und Stabilität der Anwendung sicherstellen"
                    ]
                }
            ]
        },
        {
            "company": "Voice Snap",
            "logo": "/assets/images/voicesnap_logo.jpg",
            "link": "https://www.linkedin.com/company/voicesnap-software/",
            "type": "Praktikum",
            "duration": "2 monate",
            "location": "Chennai, Indien",
            "roles": [
                {
                    "title": "Web Developer", 
                    "start": "Mai 2018", 
                    "end":"Juni 2018", 
                    "description": [
                        "Entwicklung einer App für die Serververwaltung/Tracking von Servern an verschiedenen Standorten."
                    ]
                }
            ]
        }
    ]
}